
<template>
  <div class="ui container">
    <div class="ui vertical masthead segment">
      <h1 class="ui header">
        用户协议
      </h1>

      <div class="ui segment">
        <h3 class="ui header">股票查询及模拟交易平台反抄袭免责声明</h3>
        <p>股票查询及模拟交易平台（以下简称“本平台”）制作组成员乐于分享相关的技术实现细节，自愿将本平台源代码发布于GitHub供学习用途（见“制作者名单 & 联系我们”部分）。但<b>制作组坚决抵制一切代码抄袭行为</b>，包括但不限于：</p>
        <p>一、未经允许将本平台的部分或全部前后端源代码复制粘贴至其他课程作业、毕业设计、学术论文等之中；</p>
        <p>二、未经允许将本平台的部分或全部前后端源代码复制粘贴至其他公开网络平台（网络社交平台、网络问答平台等），或通过打印分发等形式散布；</p>
        <p>三、未经允许将本平台的部分或全部前后端源代码应用于商业行为（如商业售卖、付费代写作业等）。</p>
        <p>本平台特此声明：<b>对任何人的任何代码抄袭行为，造成的后果本平台一概不负责。</b></p>
      </div>

      <div class="ui segment">
        <h3 class="ui header">股票查询及模拟交易平台使用说明</h3>
        <p>一、股票查询及模拟交易平台（以下简称“本平台”）为北京航空航天大学计算机学院2023-2024学年上学期《数据库系统原理》课程（以下简称“数据库课程”）期末大作业，由2023数据库课程2号小组（组员：刘博恺、邓韬、胡诗杰，以下简称“制作组”）制作。</p>
        <p>二、您同意本使用说明，即表示您自愿接受本使用说明的约束，并自愿承担由于违反规则造成的一切后果。</p>
        <p>三、尽管理论上本平台应当不会产生真实的金钱流动，但仍然建议您采取多种方式保护好自己的账号，如增强密码强度、不透露账号信息等。本平台对除数据库损坏等平台原因外的账号丢失及相关损失一概不负责。</p>
        <p>四、无论是否使用账号访问本平台，您都应当遵守《股票查询及模拟交易平台反抄袭免责声明》，拒绝代码抄袭行为。</p>
      </div>

      <h1 class="ui header">
        关于我们
      </h1>

      <div class="ui segment">
        <h3 class="ui header">制作者名单 & 联系我们</h3>
        <p><b>组长</b>：刘博恺</p>
        <p><b>前端</b>：胡诗杰、刘博恺</p>
        <p><b>后端</b>：邓韬</p>
        <p><b>数据库 & 设计文档</b>：全体组员</p>
        <p><b>项目仓库</b>：<a href="https://github.com/whoseJam/FinDatabaseFrontend">GitHub</a></p>
      </div>
    </div>
  </div>
</template>