<template>
    <div class="ui container">
      <div class="ui vertical masthead segment">
        <h1 class="ui header">
          基本查询操作说明
        </h1>

        <div class="ui segment">
          <h3 class="ui header">股市查询操作</h3>
          <p><b>股市总览操作</b>：点击导航栏“总览”选项，进入股市总览页面。可根据需要翻页、跳页、选择每页展示的股票数量等。</p>
          <p><b>个股查询操作</b>：进入主页，在搜索框中输入希望查询的股票代码，点击搜索按钮即可获得相应的股票信息。</p>
          <p><i>Hint:&ensp;在股市总览、主页推荐、自选股票、股票持仓等页面，点击显示的股票信息，可直接跳转至指定的个股信息展示页面。</i></p>
          <p><b>导出股票数据</b>：在个股查询页面，点击“下载数据”按钮，即可自动下载csv格式的股票数据表格。</p>
        </div>

        <div class="ui segment">
          <h3 class="ui header">股市新闻查看</h3>
          <p>点击导航栏“新闻”选项，即可自动查询并在页面上展示最近值得关注的市场新闻信息。</p>
        </div>

        <h1 class="ui header">
          用户操作说明
        </h1>

        <div class="ui segment">
          <h3 class="ui header">用户注册与登录</h3>
          <p><b>用户注册</b>：点击右上角“注册”按钮，按提示在相应输入框依次填写用户名、密码、电子邮箱等信息。若注册成功，会自动跳转至登录页面。</p>
          <p><b>用户登录</b>：点击右上角“登录”按钮，在相应输入框填入用户名及对应的密码。若登录成功，会自动跳转至用户主页。</p>
          <p><b>用户注销</b>：在导航栏右上角选择“注销”项，或在用户主页“用户信息”中点击“退出登录”按钮，成功注销后会自动跳转回主页。</p>
        </div>

        <div class="ui segment">
          <h3 class="ui header">用户主页操作</h3>
          <p><b>进入用户主页</b>：登录后自动跳转，或在导航栏右上角选择“用户主页”项，即可进入用户主页。</p>
          <p><b>用户信息</b>：展示用户当前头像、用户名及用户ID。可以点击“设置头像”，按提示完成头像更换操作。</p>
          <p><b>我的自选</b>：随机展示用户自选股中其中某个的数据。点击“换一个”查看其他自选股情况，或点击“总览”进入自选股查看页面。</p>
          <p><b>我的模拟</b>：展示用户当前总资产、可用资金、总盈亏等数据。点击“详情”进入模拟盘查看页面。</p>
        </div>

        <div class="ui segment">
          <h3 class="ui header">自选股加入、查看与移出</h3>
          <p><b>加入自选</b>：在个股查询页面，点击“加入自选”按钮，即可将指定个股加入到用户自选中。</p>
          <p><b>查看自选</b>：在导航栏右上角选择“自选”项，或在用户主页中“我的自选”处点击“总览”按钮，即可查看所有自选信息。</p>
          <p><b>移出自选</b>：在自选查看页面的对应表格项中点击“移出自选”，即可将指定个股从用户自选中移出。</p>
        </div>

        <div class="ui segment">
          <h3 class="ui header">委托买卖操作</h3>
          <p><b>进入委托页面</b>：可以在导航栏右上角选择“模拟盘”项至“我的模拟”页面，从“买入”或“卖出”处进入。对于买入，也可以从个股查询页面、“我的自选”页面点击“委托买入”按钮进入；对于卖出，也可以在“我的模拟”页面点击“委托卖出”按钮进入。</p>
          <p><b>提交委托</b>：根据委托页面提示，填写股票代码、委托方式、购入价格、购入股数信息，点击“买入”/“卖出”按钮即可提交委托。</p>
          <p><b>管理委托</b>：在“我的模拟”页面点击“撤单”，可以显示当前该用户的委托信息。对于未完成的委托，点击“撤单”，即可完成撤单操作。</p>
        </div>

        <div class="ui segment">
          <h3 class="ui header">资金充值/扣款操作</h3>
          <p>在“我的模拟”页面，点击“资产操作”按钮，按照提示填写金额、点击“充值”或“扣款”按钮，即可完成充值或扣款操作。</p>
        </div>

        <h1 class="ui header">
          其他
        </h1>

        <div class="ui segment">
          <h3 class="ui header">还有其他问题吗？</h3>
          <p>对于尚未提及的问题、操作中遇到的疑似故障等，可以联系制作组寻求帮助（见“关于”-“制作者名单 & 联系我们”部分）。</p>
          <p>To be continued...</p>
        </div>

      </div>
    </div>
  </template>